import numpy as np
from numpy import *

a1 = mat([[1063.68,875.21,1],[811.36,2432.53,1],[1294.51,2903.63,1]])
print("相机坐标系三点：\n",a1)
print(a1.shape)
a1_ = mat([[-576.88,1638.76,1],[426.87,1508.88,1],[725.72,1827.9,1]])
print(a1_.shape)
a1_I = a1.I

print("机器人坐标系三点：\n",a1_I)
print(a1_I.shape)

tranMax = a1_I.dot(a1_)
print("相机坐标系=>机器人坐标系变换矩阵：\n",tranMax)

a_test = mat([[1007.69,2751.31,1]])

b_test = mat([[968.38,1054.4,1]])

b_result  = b_test.dot(tranMax)

a_result = a_test.dot(tranMax)

c_test = mat([[1007.69,2751.31,1]])

c_result = c_test.dot(tranMax)

print("========================01==========================")
print("实际测量结果：\n",mat([[622.68,1642.04,1]]))
print("========================01==========================")
print("试验计算结果：\n",a_result)


print("========================02==========================")
print("实际测量结果：\n",mat([[-452.98,1592.79,1]]))
print("========================02==========================")
print("试验计算结果：\n",b_result)

print("========================03==========================")
print("实际测量结果：\n",mat([[622.68,1643.04,1]]))
print("========================03==========================")
print("试验计算结果：\n",c_result)

d_test = mat([[305,220,1]])
d_result = d_test.dot(tranMax)

print("试验计算结果：\n",d_result)




