#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2019/2/25 15:09
# @Author  : Dongyang
# @Site    : 
# @File    : 根据内外参标定.py
# @Software: PyCharm Community Edition

from numpy import *
#第32张图片内外参

inMatrix = mat([[4971.35578905680,               0,2724.64311461094],
                [               0,4971.15045695182,1820.14891530843],
                [               0,               0,               1],
                ])
#外参表示靶坐标系到相机坐标系的变换矩阵
exMatrix = mat([[-0.9999, 0.0093,-0.0058,206.903061226071],
                [-0.0092,-1.0000,-0.0027,149.794434795927],
                [-0.0058,-0.0026, 1.0000,3123.09632449639],
                [      0,      0,      0,               1]])

#相机坐标系中P点坐标
Camera_xy = mat([[2766.411,2060.245,1],#X[180,0,0]
                 [3052.406,2057.465,1],#O[0,0,0]
                 [3050.265,1771.041,1],#Y[0,180,0]
                 ]).T

RobotWorld_ = mat([[2373.41,-102.32,288.01,1],#X
                  [2374.70, -282.44, 288.02,1],#O,
                  [2524.97,-281.00,288.00,1],#Y
                  ]).T

B2W = mat([
    [-7.16170839e-03,  8.34255752e-01, -1.10587561e-04,  2.37470000e+03],
    [ 9.99974353e-01, 7.99446518e-03, -4.71106710e-05, -2.82440000e+02],
    [-5.55171193e-05, -1.11034239e-04, -8.34291610e-01,  2.88020000e+02],
    [ 0.00000000e+00,  0.00000000e+00, 0.00000000e+00,  1.00000000e+00],
           ])
#相机到世界坐标系
C2W = B2W.dot(exMatrix.I)
print(C2W)
print("以下是校验内容================================：")
zc = 3123.09632449639
Camera_test_xy = inMatrix.I.dot(mat([[2523.237*zc,1584.767*zc,1*zc]]).T)

#print(Camera_test_xy)
#Camera_test_xy = Camera_test_xy[:,:]
Camera_test_xyz = row_stack((Camera_test_xy,[1]))
print("相机坐标系：")
print(Camera_test_xyz)
Robot_test_xyz = C2W.dot(Camera_test_xyz)
print("机器人坐标系：")
print(Robot_test_xyz)

